{
  "fileName": "invincible-guarding-the-globe.json",
  "title": "Invincible: Guarding the Globe Tier List",
  "description": "Comprehensive tier list of characters in Invincible: Guarding the Globe, categorized from S Tier to C Tier with detailed descriptions.",
  "heading": "Invincible: Guarding the Globe Tier List",
  "introText": "Comprehensive tier list of characters in Invincible: Guarding the Globe, categorized from S Tier to C Tier with detailed descriptions.",
  "datePublished": "2025-03-11",
  "dateModified": "2025-03-11",
  "langs": [
    "en"
  ],
  "tiers": [
    {
      "name": "S Tier",
      "data": [
        {
          "itemName": "Invincible",
          "itemDescription": "Incredibly strong and versatile attacker and great in any team and against all setups"
        },
        {
          "itemName": "Omni-Man",
          "itemDescription": "Good damage dealer and can take a couple hits as well. Even as a new player without all skills you will like him a lot but once you have his 3rd skill he can crit chain like crazy and output so much damage. Not as versatile overall as Invincible but a character you will not regret building and running"
        },
        {
          "itemName": "Robot",
          "itemDescription": "Best support in Invincible Guardian the Globe. Useful in every team and every situation with his buffing and healing"
        },
        {
          "itemName": "Red Rush",
          "itemDescription": "Nice support and can do a lot espcially silencing enemies that really hurt your team is where he shines and makes your life a lot easier when you need that"
        },
        {
          "itemName": "Atom Eve",
          "itemDescription": "Nice shielding make her very useful in pretty much all teams and along with the healing of her later skills a perfect support hero in Invincible GTG"
        }
      ]
    },
    {
      "name": "A Tier",
      "data": [
        {
          "itemName": "Doc Seismic",
          "itemDescription": "The best ranged attacker in the game right now with a lot of extra traits that make sense and absolutely good to build - only the team building is a little slim right now since the faction heroes for most parts aren't the best right now but i am sure this will change and getting a few copies now is absolutely no problem in the long run"
        },
        {
          "itemName": "Battle Beast",
          "itemDescription": "An attacker with impressive base stats and abilities, offering a balance of damage output and durability in battles"
        },
        {
          "itemName": "Universa",
          "itemDescription": "Pretty good DPS but not as op as Doc or Invincible"
        },
        {
          "itemName": "The Immortal",
          "itemDescription": "A reliable defender with damage reduction abilities and self-sustain, enhancing team defense against formidable foes"
        },
        {
          "itemName": "Titan",
          "itemDescription": "A dependable defender known for his straightforward tanking abilities, effectively absorbing damage to protect allies"
        },
        {
          "itemName": "Bulletproof",
          "itemDescription": "Similar too Shrinking Rae quite too fragile to really make an impact"
        },
        {
          "itemName": "Monster Girl",
          "itemDescription": "By far the most durable defender in Invincible Guarding the Globe! The kit is not funky, just straightforward and the stuns are great as well"
        },
        {
          "itemName": "Shrinking Rae",
          "itemDescription": "Can be alright but there are a couple better damage dealers that are less fragile. Also, she needs all her skills and timing to be good to pop off"
        },
        {
          "itemName": "Allen The Alien",
          "itemDescription": "Since release thanks to more synergies and smaller adjustments have become quite a formidable tank with also some dmage in his kit"
        },
        {
          "itemName": "Green Ghost",
          "itemDescription": "Really good support hero with stuns crowd control and her emergency healing and invisibility makes hard to deal with and a reliable support for your team"
        },
        {
          "itemName": "Thula",
          "itemDescription": "Not that she is a bad attacker but she needs quite some conditions be met to get her full potential and I always prefer more burst than DoT damage and there are already strong attackers in the game"
        },
        {
          "itemName": "Dupli-Kate",
          "itemDescription": "Alright as early game attacker but will fall off after that"
        }
      ]
    },
    {
      "name": "B Tier",
      "data": [
        {
          "itemName": "Aquarus",
          "itemDescription": "A support hero capable of removing enemy buffs and reducing debuff durations on allies, though outclassed by higher-tier supports"
        },
        {
          "itemName": "War Woman",
          "itemDescription": "A strong attacker with area-of-effect damage capabilities and the durability to off-tank, making her versatile in various combat scenarios"
        },
        {
          "itemName": "Angstrom Levy",
          "itemDescription": "If you have a Mauler team going or building, he is pretty good but overall doesn't fit in many meta teams right now"
        },
        {
          "itemName": "Damien Darkblood",
          "itemDescription": "An attacker who can reduce enemy defenses, silence targets, and restore his own health, providing versatility in combat situations"
        },
        {
          "itemName": "Kursk",
          "itemDescription": "An attacker with electrical abilities, capable of dealing sustained damage to multiple enemies simultaneously"
        }
      ]
    },
    {
      "name": "C Tier",
      "data": [
        {
          "itemName": "Rus Livingston",
          "itemDescription": "Pretty decently balanced, not outstanding or anything and for sure not a character to break up your working teams. But if you're tempted to get him and are not too deep into the exsting teams so far, he is worth it"
        },
        {
          "itemName": "Mauler Twin",
          "itemDescription": "An attacker with mini stun debuffs and team health enhancements, offering strategic control during battles"
        },
        {
          "itemName": "Rex Splode",
          "itemDescription": "Alright as early game attacker but will fall off after that"
        },
        {
          "itemName": "Magmaniac",
          "itemDescription": "An attacker with area-of-effect damage and damage-over-time abilities, effective in controlling groups of enemies"
        },
        {
          "itemName": "Tether Tyrant",
          "itemDescription": "A defender utilizing tendrils for battlefield control, excelling in manipulating enemy positions and strategies"
        },
        {
          "itemName": "Isotope",
          "itemDescription": "A support character capable of stealing enemy buffs and conditionally increasing team health, though less impactful compared to top-tier supports"
        },
        {
          "itemName": "Lucan",
          "itemDescription": "Can do some stuff in arena mode but overall not a hero to really think about all too much"
        },
        {
          "itemName": "Darkwing",
          "itemDescription": "Bad attacker, stay away and you can fodder him"
        },
        {
          "itemName": "Black Samson",
          "itemDescription": "Good defender as a rare hero and worth building early for multi-team setups in ops"
        },
        {
          "itemName": "Martian Man",
          "itemDescription": "Quite solid support as rare hero early in Invincible Guarding the Globe"
        },
        {
          "itemName": "Flaxan Leader",
          "itemDescription": "Okay in the first days but honestly fodder hero"
        }
      ]
    }
  ]
}