{
    "fileName": "optc.json",
    "title": "OPTC Tier List",
    "description": "This tier list provides a ranking of the best legends in One Piece Treasure Cruise (OPTC). The legends are ranked into S, A, B, and C tiers based on their overall power, versatility, and usefulness in various content.",
    "heading": "OPTC Tier List",
    "introText": "This tier list provides a ranking of the best legends in One Piece Treasure Cruise (OPTC). The legends are ranked into S, A, B, and C tiers based on their overall power, versatility, and usefulness in various content. This tier list is intended to be a general guideline and may not reflect the best team for every player. Factors such as playstyle, team composition, and the current content available in the game should also be considered when choosing a team.",
    "datePublished": "2024-05-13",
    "dateModified": "2024-05-13",
    "langs": [
        "en"
    ],
    "tiers": [
        {
            "name": "S Tier",
            "data": [
                {
                    "itemName": "Monkey D. Luffy, Franky, Yamato, Brook, Jewelry Bonney",
                    "itemDescription": ""
                },
                {
                    "itemName": "Roronoa Zoro, Nami, Usopp, Jesus Burgess",
                    "itemDescription": ""
                },
                {
                    "itemName": "Roronoa Zoro - Memories of Straw Hat Pirates,Gol D. Roger, Jinbe, Tony Tony Chopper",
                    "itemDescription": ""
                }
            ]
        },
        {
            "name": "A Tier",
            "data": [
                {
                    "itemName": "Edward Newgate (aka Whitebeard), Portgas D. Ace, Dracule Mihawk, Smoker, Doflamingo/Donquixote Doflamingo, Sengoku, Akainu, Kizaru",
                    "itemDescription": ""
                },
                {
                    "itemName": "Rayleigh, Bartholomew Kuma, Gecko Moria, Eneru, Blackbeard/Marshall D. Teach, Sabo, Aokiji, Monkey D. Garp",
                    "itemDescription": ""
                },
                {
                    "itemName": "Little Oars Jr, Boa Hancock, Corazon, Carrot, Olin, Uta, Kaido, Trafalgar Law, Buggy, Shanks, Eustass Kid, Silvers",
                    "itemDescription": ""
                }
            ]
        },
        {
            "name": "B Tier",
            "data": [
                {
                    "itemName": "Coby, Helmeppo, Madam Sharley, Camie, Shirahoshi, Zeff, Vista, Jozu, Urouge, Zephyr, Ain, Perona, Fossa, Nefeltari Vivi, Charlotte Pudding, Koala, Diamante, Brownbeard,",
                    "itemDescription": ""
                },
                {
                    "itemName": "Fugetsu Omusubi, Uzuki Tempura, Queen, Kozuki, Who’s-Who, Sasaki, King, Tashigi, Bao Huang, Maha, Kawamatsu, Komurasaki (aka Hiyori), Denjiro, Shimotsuki Ushimaru",
                    "itemDescription": ""
                },
                {
                    "itemName": "Okiku, Charlotte Linlin, Charlotte Perospero, Black Maria, Shutenmaru, Vinsmoke Reiju, Kin’emon, Kanjuro, Hody Jones, Dogstorm, Cat Viper, Pedro, Hongo, Shinobu, Moda",
                    "itemDescription": ""
                },
                {
                    "itemName": "Vinsmoke Niji, Vinsmoke Yonji, Lucy, Douglas Bullett, Neptune, Edward Weevil, Gild. Tesoro, Magellan, Jesus Burgess, Shiryu, Doc Q",
                    "itemDescription": ""
                }
            ]
        },
        {
            "name": "C Tier",
            "data": [
                {
                    "itemName": "Alvida, Arlong, Ben Beckman, Roux, Yasopp, Kuro, Django, Siam, Butchie, Crocodile, Don Krieg, Marco, Tsuru, Killer, Apoo, X Drake, Bonney, Capone Bege, Cindry, Emporio Ivankov Curiel, Fossa, Thatch, Pell, Chaka, Heracles Un, Wyper, Ohm, Kaku, Ryuma, Hatchan, Squard, Whitey Bay, Duval",
                    "itemDescription": ""
                },
                {
                    "itemName": "Pacifista (PX-1, PX-2), Kuja Warriors, Sentomaru, Izo Raizo, Gladius, Violet, Dellinger, Blue Gilly, Don Chin Jao, Hajrudin, Koza Blueno, Jabra, Fukuro, Hina, Caesar Clown, Vergo, Wapol, Buffalo, Sugar, Giolla, Senor Pink, Lao G, Yokozuna, Marguerite, Aphelandra, Sweetpea, Pica",
                    "itemDescription": ""
                },
                {
                    "itemName": "Bartolomeo, Inazuma, Kaiser Mustache, Boa Sandersonia, Jaguar D. Saul, Boa Marigold, Leo, Kyro,s Don Sai, Fujitora, Musshuru, Saga, Binz, Shiki, Cavendish",
                    "itemDescription": ""
                },
                {
                    "itemName": "Charlotte Galette, Charlotte Poire, Charlotte Montd’Or, Charlotte Cracker, Charlotte Flampe, Charlotte Bavarois, Suleiman, Orlumbus, Dagama, Elizabello II, Carina, Baccarat, Dice, Mr Tanaka, Oars, Blenheim, Kingdew, Haruta, Atmos",
                    "itemDescription": ""
                },
                {
                    "itemName": "Charlotte Amande, Charlotte Chiffon, Charlotte Daifuku, Charlotte Praline, Bepo, Catarina Devon, Toki, Orochi, Caribou Vander Decken IX Ideo Hammond, Coribou, Wanda, Fukurokuju, Lola, Crocus, Jack, Trebol, Page One, Gordon, Sunny-kun",
                    "itemDescription": ""
                },
                {
                    "itemName": "Milky, Karasu, Streusen, Morley, Local Sea Monster - Man-Eating Monster, Rockstar, Gyukimaru, Ganfor, Yorki, Lafitte, Van Ogre, Baron Tamago, Pekoms T Bone Hyouzou Zeo Daruma Dosun Fukaboshi",
                    "itemDescription": ""
                },
                {
                    "itemName": "Hitokiri, Kamazo, Viola, Gaban, Stussy, Tenguyama, Hitetsu, Speed, Charlotte Opera, King Riku, Otama, Ulti, Charlotte Brulee, Charlotte Oven, Charlotte Katakuri, Charlotte Smoothie",
                    "itemDescription": ""
                }
            ]
        },
        {
            "name": "D Tier",
            "data": [
                {
                    "itemName": "Aladdin, Corporal - Navy, HQ Major - Navy HQ, Demolisher (Axeman, Spearman), Pearl, Gin, Nezumi, Kuroobi, Ensign - Navy HQ, Mr 1/2/3/4/5/8/9, Mr Prince, Mr Zero, Miss Goldenweek, Miss/Ms. Valentine, Miss Monday, Miss Merry Christmas, Miss Doublefinger, Miss All Sunday, Otsuru, Blamenco",
                    "itemDescription": ""
                },
                {
                    "itemName": "Zambai, Tilestone, Gaimon, Rebecca, Absalom, Elizabeth, Caroline, Sarquiss, Bellamy, Shoujou, Montblanc Cricket, Masira, Kuroobi, Choo, Kumadori, Berry Good, Mr Genzo, Dr Hiriluk, Shu, Strawberry, Iceburg, Baby 5, Blugori, Hannyabal, Kikyo, Shuraiya",
                    "itemDescription": ""
                },
                {
                    "itemName": "Gasparde, Machvise, Jean Bart ,President Heaby, General Hotdog, Nico Olvia, Laboon, Yorki, Gairam, Sebastian, Nightin, John Giant, Wicka, Gancho, Cub, Bian, Mansherry, Curly Dadan",
                    "itemDescription": ""
                },
                {
                    "itemName": "Porchemy, Bluejam, Jean Ango, Dogura, Wadatsumi Ikaros, Groggy Monsters, Condoriano, Vasco Shot, Peachbeard, Stelly - King of Goa, Otoko, Avalo, Pizarro, Old Man Hyo, Conis",
                    "itemDescription": ""
                },
                {
                    "itemName": "Speed, Jill, St. Donquixote Homing - Ex-Celestial Dragon, Gotti, Gastino, Donald Moderate, A.O. Dorry, Broggy, Momonga, Onigumo, Basil Hawkins, Khalifa, Paulie, Rob Lucci, Kaku, Lulu, Kuromarimo, Kung Fu Dugong, Doctor Hogback, General Zombie, Satori, Shura, Gedatsu",
                    "itemDescription": ""
                },
                {
                    "itemName": "Sora, Mother Carmel, Bobbin, Diesel, Aristocroc, Makino, Kuween, Tank Lepanto, Scarlet, Fisher Tiger, Braham, Namule, Rakuyo, Satori, Shura, Shandian Warrior (Adept, Hunter), Bellmere, Domino, Sadie, Porche, Capote, Hamburg, Pickles, Big Bun, Foxy, Kamakiri, Raki, Nojiko, Purinpurin",
                    "itemDescription": ""
                }
            ]
        },
        {
            "name": "E Tier",
            "data": [
                {
                    "itemName": "Higuma, Bandits, Seaman - Navy, Apprentice - Navy, Humandrill, Fishman - Arlong Crewmember, Yellow Pirates, Red Pirates, Land of Wano Officials, Chess Peacekeeper, Millions - Baroque Works",
                    "itemDescription": ""
                },
                {
                    "itemName": "Black Pirates, Green Pirates, Blue Pirates, Bodyguard (‘Sunglasses’), Black Cat Pirates, Group Leaders, Mariejois Guard Soldier, Germa Kingdom Clone Soldier",
                    "itemDescription": ""
                },
                {
                    "itemName": "Billions - Baroque Works, Skypeia Enforcers, Captain Skypeia Guard (yellow, red), Skilled Gunner, Cannoneer Skilled, Triceratops, Rex",
                    "itemDescription": ""
                },
                {
                    "itemName": "Brontosaurus, Lapin, Dalton, Sea Cat, Banana Gator, Jigoro of the Wind, Karoo, Kaya, Minorhinoceros, Basilisk, Nola - Giant Snake, Minokoala",
                    "itemDescription": ""
                },
                {
                    "itemName": "Manticore, Genbou, Asia, Hiking Bear, Gangster Carne, Gangster Patty, Street Punk - Bounty Hunter, Pappagu, Nefeltari Cobra King of Alabasta Kingdom, Toy Soldier",
                    "itemDescription": ""
                },
                {
                    "itemName": "Sea Animal Pirates, Risky Brothers, Cerberus, Taralan, Bear Skin Rug, Zombies (Wild),Robson, Saldeath, Gyaro, Macro, Tansui, Saint Charlos, Saint Roswald, Saint Shalria, Musketeers, Donquixote Pirate Crew - Low-level",
                    "itemDescription": ""
                },
                {
                    "itemName": "Saint Mjosgard, Gloriosa, Needless, Ricky, Guards, Jailors, Sphinx, Minotaur, Minozebra, Army Wolf, Sturdy Security Officer, Punk Hazard Sentry Squad Member, Punk Hazard Gas-Mask Sentry",
                    "itemDescription": ""
                },
                {
                    "itemName": "Johnny, Yosaku, Birdie Kingdom Roc, Longarm Kingdom Tribesman, Tequila Wolf Guard, Lip “Service” Doughty, Gashed” Albion, Fish-Man District Outlaw, Hiking Bear, Pleasures, Guardians, Gifters, Heat, Wire",
                    "itemDescription": ""
                }
            ]
        }
    ]
}